%close all
%clc
%clear
%%
% Глобальные переменные
global I E S Z eta_e eta_Dksi eta_Dte
global G00 G10 G01 G11 G00Int G01Int G10Int G11Int
global DE EC beta muR betaR h

%%%%%%%%%%%%%%%%%%%%%%%%__ЗАДАНИЕ ПАРАМЕТРОВ__%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Размерные параметры
ro = 7800;                  % [кг/м^3] - плотность материала
Elastic = 2.1*10^11;        % [Па] - модуль упругости материала 
l = 0.7;                    % [м] - длина стержня
d = 20*10^-3;               % [м] - диаметр стержня 
D = 0.2;                    % [м] - диаметр диска
a = 10*10^-3;               % [м] - толщина диска

h_j = 15*10^-3;             % [м] - зазор между диском и ограничителями
e = 1*10^-3;                % [м] - величина эксцентриситета
gravity = 9.81;             % [м/c^2] - ускорение свободного падения

% Безразмерные параметры
eta_e = 0.025;              % [-] - коэффициент внешнего линейного демпфирования стержня
eta_Dksi = 0.0025;          % [-] - коэффициент внешнего линейного демфирования диска 
eta_Dte = 0.05;             % [-] - коэффициент внешнего углового демфирования диска

kappa_j = 850;              % [-] - коэффициент жесткости ограничителей
d_j = 0.06;                 % [-] - коэффициент демпфирования ограничителей   
f_j = 0.1;                  % [-] - коэффициент сухого трения c ограничителями

N = 12;                     % [-] - cкорость вращения ротора
m = 6;                     % количество участков разбиения
NumbOp=60:120:300;          %[degree] - расположение опор (от Ox против часовой стрелки)
zDisk=1;                  %[-] - кооридната расположения диска (*в пределах (0;1)*)
System_name=2;              % (1) "заделка – заделка"; (2) "консоль"
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

% Расчёт параметров
M = ro*(pi*D^2/4)*a;                % [кг] - масса диска
B = M*D^2/16;                       % [кг*м^2] - физический момент инерции диска
IR = pi*d^4/64;                     % [м^4] - геометрический момент инерции сечения стержня
mR = ro*pi*d^2/4;                   % [кг/м] - погонная масса стержня
beta = B/(M*l^2);                   % безразмерный коэффициент момента инерции диска
betaR = ro*IR/(M*l);                % безразмерный коэффициент поворотной инерции 
muR = mR*l/M;                       % безразмерный коэффициент массы стержня
chi_j = h_j/l;                      % коэффициент зазора
eD = D/l;                           % коэффициент диаметра диска
epsilon = e/l;                      % коэффициент эксцентриситета
gamma = gravity*M*l^2/(Elastic*IR); % коэффициент силы тяжести

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
h=1/m; % шаг
% Граничные случаи задание постановки диска
s=round(zDisk/h);
%if s==0         % Если поставить диск в левую заделку
  %  jC=2;       
 %elseif s==m    % Если поставить диск в правую заделку
 %    jC=m;    
%else
    jC=s+1; % нужно смещение вправо на один узел
%end
if ((zDisk>=1||zDisk<=0)&&System_name==1)
    error ('Проверьте постановку диска');
end
if ((zDisk~=1)&&System_name==2)
    error ('Проверьте постановку диска');
end
%% Подготавливаем матрицы нужных размерностей
L=m+1;        % количество узлов
E=eye(2);     % единачная матрица 2x2
S=[0 1;-1 0]; % кососимметричная матрица 2x2
I=eye(L);     % единичная матрица (кол-во узлов)x(кол-во узлов)
Z=zeros(L);   % нулевая матрица (кол-во узлов)x(кол-во узлов)

EC=zeros(L);       % нулевая матрица (кол-во узлов)x(кол-во узлов)
EC(jC,jC) = 1;     % единственный ненулевой – последний диагональный элемент

E1=zeros(L);       % нулевая матрица (кол-во узлов)x(кол-во узлов)
E1(1,1)=1;         % единственный ненулевой – 1 диагональный элемент

EL=zeros(L);       % нулевая матрица (кол-во узлов)x(кол-во узлов)
EL(L,L)=1;         % единственный ненулевой – последний диагональный элемент

DE=EL-E1;          % матрица разности 
%% --------------------------
% Подготавливаем матрицы Грина (пока все нулевые)
G00=zeros(L);G01=zeros(L);
G10=zeros(L);G11=zeros(L);
G00Int=zeros(L);G01Int=zeros(L);
G10Int=zeros(L);G11Int=zeros(L);

% Заполняем матрицы Грина

for j=1:L     % проходим по строкам матриц Грина
    for k=1:L % проходим по столбцам матриц Грина
     [G00(j,k),G01(j,k),G10(j,k),G11(j,k)]=MatrixOfGreen(j,k,h,System_name);
     [G00Int(j,k),G01Int(j,k),G10Int(j,k),G11Int(j,k)]=MatrixOfGreenInt(j,k,h,System_name);
    end
end
%% Окаймление матриц – убираем заведомо однородные степени свободы
[G00,G01,G10,G11,G00Int,G01Int,G10Int,G11Int,I,Z,EC,m,jC,DE,mnew] = Matrix_Edging(G00,G01,G10,G11,G00Int,G01Int,G10Int,G11Int,I,Z,EC,DE,m,jC,L,System_name);



%% Поиск критических скоростей
N_initial = 0; % начальная точка
step_N = 0.1; % Шаг изменения скорости
eta_i = 0.002:0.001:0.1;
vect_N_crit = zeros(length(eta_i),1);
MAX_OMEGA = zeros(length(eta_i),1);
MIN_OMEGA = zeros(length(eta_i),1);
for i = 1:length(eta_i)
    [Ncritical,MaxOm,MinOm] = Find_crit (N_initial,step_N,eta_i(i));
    vect_N_crit(i) = Ncritical;
    MAX_OMEGA(i) = MaxOm;
    MIN_OMEGA(i) = MinOm;
end

% Поиск коэффициентов
% Матрица проекта
Nmatrix = [eta_e./eta_i' ones(size(eta_i'))];

% Вычисление коэффициентов
koeffN = Nmatrix\vect_N_crit;
 a = koeffN(1)
 b = koeffN(2)




%%
figure;
grid on; hold on; box on;
plot(eta_i,vect_N_crit,'.k','MarkerSize',20)
plot(eta_i,vect_N_crit,'-k','MarkerSize',20)
plot(eta_i,a*eta_e./eta_i+b,'-r','LineWidth',2)
xline(0.005,'--','LineWidth',2)
ff = gca; 
ff.FontName = 'Times New Roman';
ff.FontSize = 20;
xlabel('\eta_{V}');
ylabel('N_{crit}');
xlim('padded')

% figure;
% grid on; hold on; box on;
% plot(eta_i,MAX_OMEGA,'.r','MarkerSize',20)
% plot(eta_i,MIN_OMEGA,'-r','LineWidth',2)









