function [G00,G02,G30]=MatrixOfGreenInt(j,k,h)

% G(r,s)

r=h*(j-1); 
s=h*(k-1);
H=(r>s);
%% Заделка - заделка
        C10=-1+3*s^2-2*s^3;          C11=6*s-6*s^2;     C12=6-12*s;
        C20=s-2*s^2+s^3;             C21=1-4*s+3*s^2;   C22=-4+6*s;
        C30=0;                       C31=0;             C32=0;
        C40=0;                       C41=0;             C42=0;

G00 = H*(r-s)^3/6   +C10*r^3/6 +C20*r^2/2 +C30*r +C40; %!
G02 = H*(r-s)       +C12*r^3/6 +C22*r^2/2 +C32*r +C42;
G30 = H + C10;


flag=1;
if s==0 || s==1
    flag=flag/2;
end             % Домножение первого и последнего столбцов на 1/2
G00=G00*flag;G02=G02*flag;G30=G30*flag;


    